# LineSegment Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineSegment Class
Members See Also
---
An output node that represents a tessellated line segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class LineSegment : IDisposable
```

Visual Basic
---
```text
Public Class LineSegment _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LineSegment : IDisposable
```

# Remarks
See also: [!:Autodesk::Revit::DB::IModelExportContext::OnLineSegment].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LineSegment
# See Also
LineSegment Members
Autodesk.Revit.DB Namespace